#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-uug9PSC4pj9CwGF5

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.api_lambdas["createHouse"].data.archive_file.source_code: Refreshing...
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.api_lambdas["initLease"].data.archive_file.source_code: Refreshing...
module.api_lambdas["getHouses"].data.archive_file.source_code: Refreshing...
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=b8e8dff93783493389ac68438bb9a05cf6abee9e]
module.api_lambdas["createHouse"].data.archive_file.source_code: Refresh complete after 0s [id=25b75e1a5a6cff6b9496ba7c6c10e468b9d0c1e4]
module.api_lambdas["getHouses"].data.archive_file.source_code: Refresh complete after 0s [id=3cb83b0323d1ffbeb160f52a21fb516977766d5e]
module.api_lambdas["initLease"].data.archive_file.source_code: Refresh complete after 0s [id=66f8eb07d25c97e7b2c8980dc7d151728270897c]
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refresh complete after 0s [id=e577589b24b8fbb044463c9d89b1b1122f330187]
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refresh complete after 0s [id=bc2c03be875cc2f88f8a3ad35ee21dd7b18823c3]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.api_lambdas["createHouse"].aws_s3_object.source_s3_bucket: Refreshing state... [id=createHouse_lambda.zip]
module.maxfrise_user_pool.aws_cognito_user_pool.users_pool: Refreshing state... [id=us-west-2_3oKP9s8K9]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.api_lambdas["getHouses"].aws_s3_object.source_s3_bucket: Refreshing state... [id=getHouses_lambda.zip]
module.api_lambdas["paymentCollector"].aws_s3_object.source_s3_bucket: Refreshing state... [id=paymentCollector_lambda.zip]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.api_lambdas["initLease"].aws_s3_object.source_s3_bucket: Refreshing state... [id=initLease_lambda.zip]
module.api_lambdas["houseOverview"].aws_s3_object.source_s3_bucket: Refreshing state... [id=houseOverview_lambda.zip]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.api_lambdas["initLease"].aws_lambda_function.lambda_function: Refreshing state... [id=initLease_TF]
module.api_lambdas["houseOverview"].aws_lambda_function.lambda_function: Refreshing state... [id=houseOverview_TF]
module.api_lambdas["createHouse"].aws_lambda_function.lambda_function: Refreshing state... [id=createHouse_TF]
module.api_lambdas["paymentCollector"].aws_lambda_function.lambda_function: Refreshing state... [id=paymentCollector_TF]
module.api_lambdas["getHouses"].aws_lambda_function.lambda_function: Refreshing state... [id=getHouses_TF]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.maxfrise_user_pool.aws_cognito_user_pool_domain.domain: Refreshing state... [id=maxfrise]
module.maxfrise_user_pool.aws_cognito_user_pool_client.client[0]: Refreshing state... [id=7akg4pgnuu8tss89ht74djv5lp]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_v2.data.template_file.maxfrise_api_v2_spec: Refreshing...
module.maxfrise_api_v2.data.template_file.maxfrise_api_v2_spec: Refresh complete after 0s [id=2015721aa92e16a5b79f518607881598d1b09b12189a02aadae5eeea0b8bea18]
module.maxfrise_api_v2.aws_api_gateway_rest_api.api_v2: Refreshing state... [id=dhp09inpz4]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=uq9zi6]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=x3fdqk]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]
module.maxfrise_api_v2.aws_api_gateway_deployment.prod_deployment: Refreshing state... [id=hq375x]
module.maxfrise_api_v2.aws_api_gateway_deployment.test_deployment: Refreshing state... [id=pxqmie]
module.api_lambdas["getHouses"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["paymentCollector"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["createHouse"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["initLease"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["houseOverview"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_v2.aws_api_gateway_stage.test_stage: Refreshing state... [id=ags-dhp09inpz4-test]
module.maxfrise_api_v2.aws_api_gateway_stage.prod_stage: Refreshing state... [id=ags-dhp09inpz4-prod]
module.maxfrise_api_v2.aws_api_gateway_stage.prod_stage: Drift detected (update)
module.maxfrise_api_v2.aws_api_gateway_stage.test_stage: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.maxfrise_api_v2.aws_api_gateway_deployment.prod_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "prod_deployment" {
      ~ created_date  = "2024-10-02T18:31:52Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:dhp09inpz4/" -> (known after apply)
      ~ id            = "hq375x" -> (known after apply)
      ~ invoke_url    = "https://dhp09inpz4.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "e5c68c8146a2b8545e7c138b6592431533faa1a0" -> "f08a7ae388135e59390824def88333408b760f88"
        }
        # (2 unchanged attributes hidden)
    }

  # module.maxfrise_api_v2.aws_api_gateway_deployment.test_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "test_deployment" {
      ~ created_date  = "2024-10-02T18:31:49Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:dhp09inpz4/" -> (known after apply)
      ~ id            = "pxqmie" -> (known after apply)
      ~ invoke_url    = "https://dhp09inpz4.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "e5c68c8146a2b8545e7c138b6592431533faa1a0" -> "f08a7ae388135e59390824def88333408b760f88"
        }
        # (2 unchanged attributes hidden)
    }

  # module.maxfrise_api_v2.aws_api_gateway_rest_api.api_v2 will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "api_v2" {
      ~ body                         = <<-EOT
            openapi: "3.0.1"
            info:
              title: "Maxfrise API v2"
              version: "1.0"
            paths:
          -   /initLease:
          +   /initlease:
                post:
                  summary: "Service to initialize the lease"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:914036813947:function:initLease_TF/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
          -   /paymentCollector:
          +   /collectpayment:
                post:
                  summary: "Service to collect payments"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:914036813947:function:paymentCollector_TF/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
          -   /createHouse:
          +   /createhouse:
                post:
                  summary: "Service to create houses"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:914036813947:function:createHouse_TF/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
          -   /getHouses:
          +   /gethouses:
                get:
                  summary: "Service to get houses"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:914036813947:function:getHouses_TF/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
          -   /houseOverview:
          +   /houseoverview:
                get:
                  summary: "Function to get the house overview"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:914036813947:function:houseOverview_TF/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
        EOT
        id                           = "dhp09inpz4"
        name                         = "MaxfriseApiV2"
        tags                         = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.maxfrise_api_v2.aws_api_gateway_stage.prod_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod_stage" {
      ~ deployment_id         = "hq375x" -> (known after apply)
        id                    = "ags-dhp09inpz4-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # module.maxfrise_api_v2.aws_api_gateway_stage.test_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "test_stage" {
      ~ deployment_id         = "rx1uom" -> (known after apply)
        id                    = "ags-dhp09inpz4-test"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*